//=============================================================================
//
// フェード設定
// Author : Hamada Ryuuga
//
//=============================================================================
//-----------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------
#include <stdio.h>
#include <assert.h>
#include "fade.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CFade::CFade() :CObject2d(4)
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CFade::~CFade()
{
}

//=============================================================================
// 初期化
//=============================================================================
HRESULT CFade::Init(void)
{
	AttachProtect();
	// 現在のモーション番号の保管
	CObject2d::Init();
	m_fadeSp = 0.07f;
	m_fadeSet = 0.0f;

	return S_OK;
}

//=============================================================================
// 終了
//=============================================================================
void CFade::Uninit(void)
{
	// 現在のモーション番号の保管
	 CObject2d::Uninit();
}

//=============================================================================
// 更新
//=============================================================================
void CFade::Update(void)
{
	if (m_fade != FADENON)
	{
		// 現在のモーション番号の保管
		CObject2d::Update();
		if (m_fade == FADEOUT)
		{
			m_fadeSet -= m_fadeSp;
		}
		if (m_fade == FADEIN)
		{
			m_fadeSet += m_fadeSp;
		}

		if (m_fadeSet >= 1.0f)
		{
			m_fade = FADEOUT;
			m_fadeSet = 1.0f;
			CApplication::GetInstance()->SetMode(m_nextMode);

		}
		if (m_fadeSet <= 0.0f)
		{
			m_fade = FADENON;

			m_fadeSet = 0.0f;

			return;
		}
		SetColar(D3DXCOLOR(0.0f, 0.0f, 0.0f, m_fadeSet));
	}
}

//=============================================================================
// 描画
//=============================================================================
void CFade::Draw(void)
{
	 CObject2d::Draw();
}

//=============================================================================
// create
//=============================================================================
CFade* CFade::Create()
{
	CFade * pObject = new CFade;

	if (pObject != nullptr)
	{
		pObject->Init();
		pObject->m_nextMode = CApplication::MODE_TITLE;
		pObject->SetSize(D3DXVECTOR3(1280.0f, 720.0f, 0.0f));
		pObject->SetColar(D3DXCOLOR(0.0f, 0.0f, 0.0f, 0.0f));
		pObject->SetType(CObject::MODE);
		pObject->m_fade = FADENON;
	}
	return pObject;
}


//=============================================================================
// 次のモードに移行
//=============================================================================
void CFade::NextMode(CApplication::MODE nextMode)
{
	if (m_fade != FADENON)
	{
		return;
	}

	/* ↓フェードを移行する場合↓ */

	Init();
	m_nextMode = nextMode;
	SetSize(D3DXVECTOR3(1280.0f, 720.0f, 0.0f));
	SetColar(D3DXCOLOR(0.0f, 0.0f, 0.0f, 0.0f));
	m_fade = FADEIN;
}
