//=============================================================================
//
// モードクラスのヘッダー
// Author:Hamada Ryuuga
//
//=============================================================================
#ifndef _MODE_H_		//このマクロが定義されてなかったら
#define _MODE_H_		//2重インクルード防止のマクロ定義

//-----------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------
#include "task.h"

//=============================================================================
// ゲームクラス
//=============================================================================
class CMode : public CTask
{
public:
	CMode() : CTask(CTaskGroup::EPushMethod::PUSH_CURRENT, 0) {}
	~CMode() override {}

	virtual HRESULT Init() override = 0;
	virtual void Uninit() override = 0;
	virtual void Update() override = 0;
	virtual void Draw() override = 0;

private:
};
#endif