//=============================================================================
//
// オブジェクト
// Author : Hamada Ryuuga
// Author : Yuda Kaito
//
//=============================================================================
//-----------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------
#include "object.h"
#include "application.h"
#include <assert.h>

//=============================================================================
// コンストラクタ
//=============================================================================
CObject::CObject(CTaskGroup::EPriority inPriority, CTaskGroup::EPushMethod inMethod) :
	CTask(inPriority, inMethod),
	m_updateStatus(EUpdateStatus::POP),
	m_pos(D3DXVECTOR3(0.0f,0.0f,0.0f)),		// 位置
	m_move(D3DXVECTOR3(0.0f, 0.0f, 0.0f)),	// 移動量
	m_rot(D3DXVECTOR3(0.0f, 0.0f, 0.0f)),	// 回転量
	m_size(D3DXVECTOR3(0.0f, 0.0f, 0.0f)),	// 大きさ
	m_color(D3DXCOLOR(0.0f,0.0f,0.0f,1.0f))	// 色
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CObject::~CObject()
{
}

//=============================================================================
// 更新
//=============================================================================
void CObject::Update()
{
	switch (m_updateStatus)
	{
	case CObject::EUpdateStatus::POP:
		PopUpdate();
		break;
	case CObject::EUpdateStatus::NORMAL:
		NormalUpdate();
		break;
	case CObject::EUpdateStatus::END:
		EndUpdate();
		break;
	default:
		assert(false);
		break;
	}
}

//=============================================================================
// 出現中の更新
//=============================================================================
void CObject::PopUpdate()
{
	m_updateStatus = EUpdateStatus::NORMAL;
}

//=============================================================================
// 通常中の更新
//=============================================================================
void CObject::NormalUpdate()
{
}

//=============================================================================
// 終了中の更新
//=============================================================================
void CObject::EndUpdate()
{
	Release();
}
