//=============================================================================
//
// オブジェクト
// Author : Hamada Ryuuga
//
//=============================================================================
//-----------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------
#include "object.h"
#include "manager.h"
#include <assert.h>

//=============================================================================
// コンストラクタ
//=============================================================================
CObject::CObject(int inList) :
	m_updateStatus(POP)
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CObject::~CObject()
{
}

//=============================================================================
// 更新
//=============================================================================
void CObject::Update()
{
	switch (m_updateStatus)
	{
	case CObject::POP:
		PopUpdate();
		break;
	case CObject::NORMAL:
		NormalUpdate();
		break;
	case CObject::END:
		EndUpdate();
		break;
	default:
		assert(false);
		break;
	}
}

//=============================================================================
// 出現中の更新
//=============================================================================
void CObject::PopUpdate()
{
	m_updateStatus = NORMAL;
}

//=============================================================================
// 通常中の更新
//=============================================================================
void CObject::NormalUpdate()
{
}

//=============================================================================
// 終了中の更新
//=============================================================================
void CObject::EndUpdate()
{
	Release();
}

//=============================================================================
// タイプの設定
//=============================================================================
void CObject::SetUp(EType inType)
{
	switch (inType)
	{
	case EType::ENEMY:
		m_type = ENEMY;
		break;
	case EType::PLAYER:
		m_type = PLAYER;
		break;
	case EType::BULLET:
		m_type = BULLET;
		break;
	case EType::GON:
		m_type = GON;
		break;
	case EType::MAGIC:
		m_type = MAGIC;
		break;
	case EType::CRYSTAL:
		m_type = CRYSTAL;
		break;
	case EType::BG:
		m_type = BG;
		break;
	case EType::MODE:
		m_type = MODE;
		break;
	case EType::PAUSE:
		m_type = PAUSE;
		break;
	default:
		assert(false);
		break;
	}
}

//=============================================================================
// タイプの取得
//=============================================================================
CObject::EType CObject::GetType()
{
	return m_type;
}
